tiborsimon/embedded-tdd-headers/pic/pic18/pic18f6490_tdd.h
#define HLVDIP                        1091
#define LVDIP                         1092
#define BCLIP                         1093
#define CMIP                          1094
#define OSCFIP                        1095
#define PIE3                          1096
#define TXB2IE                        1097
#define TX2IE                         1098
#define TXBNIE                        1099
#define RC2IE                         1100
#define LCDIE                         1101
#define PIR3                          1102
#define TX2IF                         1103
#define TXBNIF                        1104
#define RC2IF                         1105
#define LCDIF                         1106
#define IPR3                          1107
#define TXBNIP                        1108
#define TX2IP                         1109
#define RC2IP                         1110
#define LCDIP                         1111
#define RCSTA1                        1112
#define RCSTA1_RX9D                   1113
#define RX9D1                         1114
#define RCSTA1_RCD8                   1115
#define RCSTA1_OERR                   1116
#define OERR1                         1117
#define RCSTA1_FERR                   1118
#define FERR1                         1119
#define RCSTA1_ADDEN                  1120
#define RCSTA1_ADEN                   1121
#define ADDEN1                        1122
#define RCSTA1_CREN                   1123
#define CREN1                         1124
#define SRENA                         1125
#define SREN1                         1126
#define RCSTA1_SREN                   1127
#define RCSTA1_RC9                    1128
#define RCSTA1_RC8_9                  1129
#define RCSTA1_RX9                    1130
#define RX91                          1131
#define RCSTA1_SPEN                   1132
#define SPEN1                         1133
#define TXSTA1                        1134
#define TX9D1                         1135
#define TXSTA1_TX9D                   1136
#define TXSTA1_TXD8                   1137
#define TRMT1                         1138
#define TXSTA1_TRMT                   1139
#define BRGH1                         1140
#define TXSTA1_BRGH                   1141
#define SENDB1                        1142
#define SENDB                         1143
#define TXSTA1_SYNC                   1144
#define SYNC1                         1145
#define TXEN1                         1146
#define TXSTA1_TXEN                   1147
#define TX91                          1148
#define TXSTA1_TX8_9                  1149
#define TXSTA1_TX9                    1150
#define TXSTA1_CSRC                   1151
#define CSRC1                         1152
#define T3CON                         1153
#define TMR3ON                        1154
#define TMR3CS                        1155
#define nT3SYNC                       1156
#define NOT_T3SYNC                    1157
#define T3SYNC                        1158
#define T3INSYNC                      1159
#define SOSCEN3                       1160
#define T3CCP1                        1161
#define T3CKPS                        1162
#define T3CKPS0                       1163
#define T3CKPS1                       1164
#define T3CCP2                        1165
#define T3CON_RD16                    1166
#define RD163                         1167
#define T3RD16                        1168
#define CMCON                         1169
#define CM                            1170
#define CMEN0                         1171
#define CM0                           1172
#define CMEN1                         1173
#define CM1                           1174
#define CMEN2                         1175
#define CM2                           1176
#define CIS                           1177
#define C1INV                         1178
#define C2INV                         1179
#define C1OUT                         1180
#define C2OUT                         1181
#define CVRCON                        1182
#define CVR                           1183
#define CVR0                          1184
#define CVR1                          1185
#define CVR2                          1186
#define CVR3                          1187
#define CVRSS                         1188
#define CVREF                         1189
#define CVRR                          1190
#define CVROEN                        1191
#define CVROE                         1192
#define CVREN                         1193
#define CCP2CON                       1194
#define CCP2M                         1195
#define CCP2M0                        1196
#define CCP2M1                        1197
#define CCP2M2                        1198
#define CCP2M3                        1199
#define DC2B0                         1200
#define DCCP2Y                        1201
#define CCP2Y                         1202
#define DC2B                          1203
#define DC2B1                         1204
#define DCCP2X                        1205
#define CCP2X                         1206
#define CCP1CON                       1207
#define CCP1M0                        1208
#define CCP1M                         1209
#define CCP1M1                        1210
#define CCP1M2                        1211
#define CCP1M3                        1212
#define DCCP1Y                        1213
#define CCP1Y                         1214
#define DC1B                          1215
#define DC1B0                         1216
#define CCP1X                         1217
#define DCCP1X                        1218
#define DC1B1                         1219
#define ADCON2                        1220
#define ADCS0                         1221
#define ADCS                          1222
#define ADCS1                         1223
#define ADCS2                         1224
#define ACQT0                         1225
#define ACQT                          1226
#define ACQT1                         1227
#define ACQT2                         1228
#define ADFM                          1229
#define ADCON1                        1230
#define PCFG0                         1231
#define PCFG                          1232
#define PCFG1                         1233
#define PCFG2                         1234
#define CHSN3                         1235
#define PCFG3                         1236
#define VCFG                          1237
#define VCFG0                         1238
#define VCFG01                        1239
#define VCFG11                        1240
#define VCFG1                         1241
#define ADCON0                        1242
#define ADON                          1243
#define nDONE                         1244
#define GO_nDONE                      1245
#define NOT_DONE                      1246
#define GODONE                        1247
#define GO_DONE                       1248
#define DONE                          1249
#define GO_NOT_DONE                   1250
#define GO                            1251
#define CHS0                          1252
#define CHS                           1253
#define CHS1                          1254
#define CHS2                          1255
#define CHS3                          1256
#define SSPCON2                       1257
#define SEN                           1258
#define RSEN                          1259
#define PEN                           1260
#define RCEN                          1261
#define ACKEN                         1262
#define ACKDT                         1263
#define ACKSTAT                       1264
#define GCEN                          1265
#define SSPCON1                       1266
#define SSPM0                         1267
#define SSPM                          1268
#define SSPM1                         1269
#define SSPM2                         1270
#define SSPM3                         1271
#define CKP                           1272
#define SSPEN                         1273
#define SSPOV                         1274
#define WCOL                          1275
#define SSPSTAT                       1276
#define BF                            1277
#define UA                            1278
#define R_NOT_W                       1279
#define READ_WRITE                    1280
#define NOT_W                         1281
#define R_W                           1282
#define nW                            1283
#define RW                            1284
#define nWRITE                        1285
#define R                             1286
#define NOT_WRITE                     1287
#define R_nW                          1288
#define I2C_READ                      1289
#define START                         1290
#define S                             1291
#define I2C_START                     1292
#define STOP                          1293
#define I2C_STOP                      1294
#define P                             1295
#define NOT_A                         1296
#define DATA_ADDRESS                  1297
#define nA                            1298
#define D_A                           1299
#define D_nA                          1300
#define D                             1301
#define DA                            1302
#define D_NOT_A                       1303
#define NOT_ADDRESS                   1304
#define nADDRESS                      1305
#define I2C_DAT                       1306
#define CKE                           1307
#define SMP                           1308
#define T2CON                         1309
#define T2CKPS0                       1310
#define T2CKPS                        1311
#define T2CKPS1                       1312
#define TMR2ON                        1313
#define T2OUTPS0                      1314
#define TOUTPS                        1315
#define T2OUTPS1                      1316
#define T2OUTPS2                      1317
#define T2OUTPS3                      1318
#define PR2                           1319
#define WM0                           1320
#define WM1                           1321
#define WAIT0                         1322
#define WAIT1                         1323
#define EBDIS                         1324
#define T1CON                         1325
#define TMR1ON                        1326
#define TMR1CS                        1327
#define NOT_T1SYNC                    1328
#define T1SYNC                        1329
#define nT1SYNC                       1330
#define T1INSYNC                      1331
#define T1OSCEN                       1332
#define SOSCEN                        1333
#define T1CKPS0                       1334
#define T1CKPS                        1335
#define T1CKPS1                       1336
#define T1RUN                         1337
#define T1RD16                        1338
#define T1CON_RD16                    1339
#define RCON                          1340
#define BOR                           1341
#define NOT_BOR                       1342
#define nBOR                          1343
#define POR                           1344
#define nPOR                          1345
#define NOT_POR                       1346
#define PD                            1347
#define nPD                           1348
#define NOT_PD                        1349
#define NOT_TO                        1350
#define nTO                           1351
#define TO                            1352
#define nRI                           1353
#define NOT_RI                        1354
#define RI                            1355
#define SBOREN                        1356
#define IPEN                          1357
#define WDTCON                        1358
#define SWDTE                         1359
#define SWDTEN                        1360
#define HLVDCON                       1361
#define HLVDL                         1362
#define HLVDL0                        1363
#define LVV0                          1364
#define LVDL0                         1365
#define HLVDL1                        1366
#define LVV1                          1367
#define LVDL1                         1368
#define HLVDL2                        1369
#define LVV2                          1370
#define LVDL2                         1371
#define HLVDL3                        1372
#define LVV3                          1373
#define LVDL3                         1374
#define HLVDEN                        1375
#define LVDEN                         1376
#define BGST                          1377
#define IRVST                         1378
#define VDIRMAG                       1379
#define OSCCON                        1380
#define SCS0                          1381
#define SCS                           1382
#define SCS1                          1383
#define FLTS                          1384
#define IOFS                          1385
#define OSTS                          1386
#define IRCF                          1387
#define IRCF0                         1388
#define IRCF1                         1389
#define IRCF2                         1390
#define IDLEN                         1391
#define T0CON                         1392
#define T0PS                          1393
#define T0PS0                         1394
#define T0PS1                         1395
#define T0PS2                         1396
#define PSA                           1397
#define T0SE                          1398
#define T0CS                          1399
#define T08BIT                        1400
#define TMR0ON                        1401
#define STATUS                        1402
#define C                             1403
#define CARRY                         1404
#define DC                            1405
#define ZERO                          1406
#define Z                             1407
#define OV                            1408
#define OVERFLOW                      1409
#define N                             1410
#define NEGATIVE                      1411
#define INTCON3                       1412
#define INT1IF                        1413
#define INT1F                         1414
#define INT2IF                        1415
#define INT2F                         1416
#define INT3F                         1417
#define INT3IF                        1418
#define INT1E                         1419
#define INT1IE                        1420
#define INT2IE                        1421
#define INT2E                         1422
#define INT3E                         1423
#define INT3IE                        1424
#define INT1P                         1425
#define INT1IP                        1426
#define INT2IP                        1427
#define INT2P                         1428
#define INTCON2                       1429
#define RBIP                          1430
#define INT3IP                        1431
#define INT3P                         1432
#define TMR0IP                        1433
#define T0IP                          1434
#define INTEDG3                       1435
#define INTEDG2                       1436
#define INTEDG1                       1437
#define INTEDG0                       1438
#define RBPU                          1439
#define NOT_RBPU                      1440
#define nRBPU                         1441
#define INTCON                        1442
#define RBIF                          1443
#define INT0F                         1444
#define INT0IF                        1445
#define T0IF                          1446
#define TMR0IF                        1447
#define RBIE                          1448
#define INT0E                         1449
#define INT0IE                        1450
#define T0IE                          1451
#define TMR0IE                        1452
#define PEIE                          1453
#define PEIE_GIEL                     1454
#define GIEL                          1455
#define GIE_GIEH                      1456
#define GIE                           1457
#define GIEH                          1458
#define STKPTR0                       1459
#define STKPTR                        1460
#define STKPTR1                       1461
#define STKPTR2                       1462
#define STKPTR3                       1463
#define STKPTR4                       1464
#define STKUNF                        1465
#define STKOVF                        1466
#define STKFUL                        1467

#endif // _PIC18F6490_H_
